cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

# Essentials
brew 'kryptco/tap/kr'
brew 'editorconfig'
brew 'node'
brew 'php'
brew 'composer'
brew 'jq'
brew 'vim'
brew 'starship'
brew 'getantibody/tap/antibody'
brew 'yarn'
brew 'ripgrep'
brew 'vim'
brew 'sqlite'
brew 'zsh'
brew 'exa'

# Useful addons
cask 'quicklook-csv'
cask 'quicklook-json'

# Applications
cask '1password'
cask 'iterm2'
cask 'google-chrome'
cask 'spotify'
cask 'alfred'
cask 'docker'
cask 'insomnia'
cask 'visual-studio-code'
cask 'transmit'
cask 'spectacle'
cask 'jetbrains-toolbox'
cask 'tableplus'
cask 'dropbox'
cask 'choosy'
cask 'hey'
cask 'whatsapp'
cask 'telegram'

# Fonts
cask 'font-fira-code'
cask 'font-bebas-neue'
cask 'font-ibm-plex'
cask 'font-jetbrains-mono'
cask 'font-jetbrainsmono-nerd-font'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu'