robbyrussell/oh-my-zsh path:lib/clipboard.zsh
robbyrussell/oh-my-zsh path:lib/completion.zsh
robbyrussell/oh-my-zsh path:lib/history.zsh
robbyrussell/oh-my-zsh path:plugins/docker kind:fpath

zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

zdharma-continuum/fast-syntax-highlighting
caarlos0/ports